Repository: yamato/perl6doc-jp
Catalog: tm/auto/S02-bits-20140914.tmx
Source language: en_us
Languages: ja

source: The more general of those would apply to what is common to any dense sequence (&quot;string&quot;) that Str and Blob both are (either of characters or bits or integers etc), and the string operators like catenation (~) and replication (x, xx) would be part of the more general role.
ja: それらでより一般的なものは何がStrとBlobが両方ともそうである（文字またはビットまたは整数のどちらでもその他）何か高密度配列（「文字列」）に共通かについてあてはまる、そして、列演算子はカテネーション（~）を好む、そして、複製（x、xx）はより多くの一般ロールの一部である。

source: The more specific role would apply to Str but not Blob and includes any specific operators that are specific to characters and don't apply to bits or integers etc. The other alternative is to more clearly distance character strings from bit strings, keeping ~/etc for character strings only and adding an analogy for bit strings.]
ja: より特定のロールがBlobでなくStrに申し込んで、文字に特有で、ビットまたは整数その他に申し込まない何か特定の演算子を含むほど選択肢はより明らかに文字文字列をビット列から遠ざけるためにより別である。そして、文字文字列のためにだけ~/etcをとっておいて、ビット列のために類似を加える。］

source: The Iterable role indicates not that you can iterate the type directly, but that you can request the type to return an iterator.
ja: Iterableロールは、あなたが直接型を繰り返すことができて、でなく、あなたが型に反復子を返るよう求めることができることを示す。

source: Iterable types may have multiple iterators (lists) running across them simultaneously, but an iterator/list itself has only one thread of consumption.
ja: Iterableな型には同時にそれらに出会っている複数の反復子（リスト）があるかもしれない、しかし、反復子/リストそのものは消費の1つのスレッドだけを持つ。

source: Every time you do get on an iterator, a value disappears from its list.
ja: あなたが反復子でgetをするすべての時、値はそのリストから消える。

source: Note that Set, Bag, and Mix iterators return only keys, not values.
ja: Set、BagとMix反復子がキー（値でない）だけを返ることに注意すべきである。

source: You must explicitly use c&lt;.pairs&gt; to get key/value pairs.
ja: あなたは、cをはっきりと使わなければならない&lt;キー/値組を得る.pairs＞。

source: Mutable types
ja: 変わりやすい型

source: Objects with these types have distinct .WHICH values that do not change even if the object's contents change.
ja: これらの型によるオブジェクトは、たとえオブジェクトの内容が変わるとしても、変わらない異なった.WHICH値を持つ。

source: (Routines are considered mutable because they can be wrapped in place.)
ja: （それらが適所に包まれることができるので、ルーチンは変わりやすいと考えられる。）

source: The QuantHash role differs from a normal Associative hash in how it handles default values.
ja: QuantHashロールは、通常のAssociativeハッシュと、それがデフォルト値を取り扱う方法において異なる。

source: If the value of a QuantHash element is set to the default value for the QuantHash, the element is deleted.
ja: QuantHash要素の値がQuantHashのためにデフォルト値にセットされるならば、要素はアンインストール済みである。

source: If undeclared, the default default for a QuantHash is 0 for numeric types, False for boolean types, and the null string for string and buffer types.
ja: 宣言されていないならば、QuantHashのためのデフォルトデフォルトは数値型のための0、論理型のためのFalseと文字列とバッファタイプの空文字列である。

source: A QuantHash of an object type defaults to the undefined prototype for that type.
ja: オブジェクト型のQuantHashは、その型のために未定義プロトタイプにデフォルトでなる。

source: More generally, the default default is whatever defined value a Nil would convert to for that value type.
ja: より通常、デフォルトデフォルトは、Nilがその値型のために変わるどんな定義済み値でもある。

source: A QuantHash of Scalar deletes elements that go to either 0 or the null string.
ja: ScalarのQuantHashは、0か空文字列へ行く要素を削除する。

source: A QuantHash also autodeletes keys for normal undefined values (that is, those undefined values that do not contain an unthrown exception).
ja: また、autodeletesが通常の未定義値（つまり、unthrown例外を含まないそれらの未定義値）のために観察するQuantHash。

source: A SetHash is a QuantHash of booleans with a default of False.
ja: SetHashは、FalseのデフォルトによるブーリアンのQuantHashである。

source: If you use the Hash interface and increment an element of a SetHash its value becomes true (creating the element if it doesn't exist already).
ja: あなたがHashインターフェースを使用して、SetHashの要素をインクリメントするならば、その値は真実に（それがすでに存在しないならば、要素を作成する）なる。

source: If you decrement the element it becomes false and is automatically deleted.
ja: あなたが要素をデクリメントするならば、それは間違ったようになって、自動的にアンインストール済みである。

source: Decrementing a non-existing value results in a False value.
ja: 非既存の値をデクリメントすることは、結果としてFalse値になる。

source: Incrementing an existing value results in True.
ja: 既存の値をインクリメントすることは、結果としてTrueになる。

source: When not used as a Hash (that is, when used as an Array or list or Set object) a SetHash behaves as a Set of its keys. (Since the only possible value of a SetHash is the True value, it need not be represented in the actual implementation with any bits at all.)
ja: Hash（つまり、ArrayまたはリストまたはSetオブジェクトとして使われるとき）として使われないとき、SetHashはそのキーのSetとしてふるまう。（SetHashの唯一のあり得る値がTrue値であるので、それはまったく何かビットで実際の実装で表現される必要はない。）

source: A BagHash is a QuantHash of UInt with default of 0.
ja: BagHashは、0のデフォルトによるUIntのQuantHashである。

source: If you use the Hash interface and increment an element of a BagHash its value is increased by one (creating the element if it doesn't exist already).
ja: あなたがHashインターフェースを使用して、BagHashの要素をインクリメントするならば、その値は1（それがすでに存在しないならば、要素を作成する）増やされる。

source: If you decrement the element the value is decreased by one;
ja: あなたが要素をデクリメントするならば、値は1時までに減少する;

source: if the value goes to 0 the element is automatically deleted.
ja: 値が0へ行くならば、要素は自動的にアンインストール済みである。

source: An attempt to decrement a non-existing value returns a Failure value. When not used as a Hash (that is, when used as an Array or list or Bag object) a BagHash behaves as a Bag of its keys, with each key replicated the number of times specified by its corresponding value.
ja: 非既存の値をデクリメントする試みは、Failure値を返る。BagHashがそのキーのBagとして行儀よくするHash（つまり、ArrayまたはリストまたはBagオブジェクトとして使われるとき）として使われないとき、各々で、キーはその相当値で特定された回数を複製した。

source: (Use .kv or .pairs to suppress this behavior in list context.)
ja: （リストコンテキストでこのふるまいを抑えるために、.kvまたは.pairsを使いなさい。）

source: As with Hash types, Pair and PairSeq are mutable in their values but not in their keys.
ja: Hash型と同様に、PairとPairSeqは、彼らのキーでなく彼らの値で変わりやすい。

source: (A key can be a reference to a mutable object, but cannot change its .WHICH identity.
ja: （キーは可変対象物への言及でありえるが、その.WHICHアイデンティティを変えることができない。

source: In contrast, the value may be rebound to a different object, just as a hash element may.)
ja: 対照的に、ちょうどハッシュ要素がそうするかもしれなくて、値は異なるオブジェクトに再結合されるかもしれない。）

source: The following roles are supported:
ja: 以下のロールはサポートされる：

source: Types that do the List role are generally hidden from casual view, since iteration is typically triggered by context rather than by explicit call to the iterator's .get method.
ja: 繰り返しが反復子の.getメソッドへの明示的呼び出しによってよりもむしろ前後関係によって典型的に引き起こされる時から、Listロールをする型は通常、さりげない見方から隠される。

source: Filehandles are a notable exception.
ja: ファイルハンドルは、顕著な例外である。

source: See &quot;Wrapping&quot; in S06 for a discussion of soft vs. hard routines.
ja: 柔らかい対難しいルーチンに関する議論のために、S06で&quot;Wrapping&quot;を見なさい。

source: Of types
ja: 型の

source: Explicit types are optional.
ja: 明示的型はオプションである。

source: Perl variables have two associated types:
ja: Perl変数には、2つの関連した型がある：

source: their &quot;of type&quot; and their &quot;container type&quot;.
ja: 彼ら「型」と彼らの「コンテナ型」の。

source: (More generally, any container has a container type, including subroutines and modules.) The of type is stored as its of property, while the container type of the container is just the object type of the container itself.
ja: コンテナのコンテナ型がちょうどコンテナ自体のオブジェクト型である間、of型はそのofの資産として保存される（より通常、何かコンテナはコンテナ型（サブルーチンとモジュールを含む）を持つ。）。

source: The word returns is allowed as an alias for of.
ja: ワードreturnsは、ofの別名として許される。

source: The of type specifies what kinds of values may be stored in the variable.
ja: of型は、どんな種類の値が変数に保管されるかもしれないかについて指定する。

source: An of type is given as a prefix or with the of keyword:
ja: of型は、接頭辞として、または、ofキーワードで与えられる：

source: In either case this sets the of property of the container to Dog.
ja: いずれにせよ、これはコンテナのofプロパティをDogに設定する。

source: You may not mix these notations;
ja: これらの表記法を混ぜなくてもよい;

source: if you do, a compiler error will result.
ja: あなたがそうするならば、コンパイラエラーは起こる。

source: An of type on an array or hash specifies the type stored by each element:
ja: 配列またはハッシュに関するof型は、各々の要素で保存される型を指定する：

source: The key type of a hash may be specified as a shape trait--see S09.
ja: ハッシュのキー型は形トレイトとして指定されるかもしれない－S09を見なさい。

source: Containers enforce type safety on setting, whereas subroutines enforce type safety on return.
ja: コンテナは型安全をセッティングに強制する、ところが、サブルーチンは型安全を復帰に強制する。

source: The returns declarations is an alias for the of type of a subroutine.
ja: returns宣言、ofの別名は、サブルーチンの型である。

source: To coerce your return value, use a coercion type:
ja: あなたの戻り値を強制して、強制型を使うこと：

source: For a container, however, use of a coercion type as the of coerces upon setting rather than returning the value.
ja: しかし、コンテナのために、ofとしての強制型の使用は、返ることよりもむしろセッティングと同時に、値を強制する。

source: Container types
ja: コンテナ型

source: The container type specifies how the variable itself is implemented.
ja: コンテナ型は、変数自体がどのように実装されるかについて指定する。

source: It is given as a trait of the variable:
ja: それは、変数のトレイトとして与えられる：

source: Defining a container type is the Perl 6 equivalent to tying a variable in Perl 5.
ja: コンテナ型を定義することは、Perl 5で変数を結合することに等しいPerl 6である。

source: But Perl 6 variables are tied directly at declaration time, and for performance reasons may not be tied with a run-time tie statement unless the variable is explicitly declared with a container type that does the Tieable role.
ja: しかし、Perl 6変数は宣言時間に直接結合されて、パフォーマンス理由のために、変数がTieableロールをするコンテナ型ではっきりと宣言されない限り実行時tie文で結合されないかもしれない。

source: However, package variables are always considered Tieable by default.
ja: しかし、パッケージ変数は、デフォルトで常によく考えたTieableである。

source: As a consequence, all named packages are also Tieable by default.
ja: 結果として、すべての挙げられたパッケージは、デフォルトでTieableでもある。

source: Classes and modules may be viewed as differently tied packages.
ja: クラスとモジュールは、違って結合されたパッケージとして見られるかもしれない。

source: Looking at it from the other direction, classes and modules that wish to be bound to a global package name must be able to do the Package role.
ja: 縛られていることを望む他の方向、クラスとモジュールから世界的なパッケージ名までそれを見ることは、Packageロールをすることができなければならない。

source: Hierarchical types
ja: 階層型

source: A non-scalar type may be qualified, in order to specify what type of value each of its elements stores:
ja: その要素の各々がどんなタイプの値を保存するかについて指定するために、非スカラー型型は資格がある場合がある：

source: Each successive of makes the type on its right a parameter of the type on its left.
ja: 各々の連続したofは、右の上の型をその左の上の型のパラメータとする。

source: Parametric types are named using square brackets, so:
ja: パラメータの型は、そう、角括弧を使って挙げられる：

source: actually means:
ja: 実は、以下を意味する：

source: which is:
ja: そしてそれは以下の通りである：

source: Because the actual variable can be hard to find when complex types are specified, there is a postfix form as well:
ja: 複素数型が指定されるとき実際の変数が見つけるのが難しくありえるので、接尾辞の形態が同様にある：

source: Alternately, the return type may be specified within the signature:
ja: あるいは、戻り型は、シグネチャの中で指定されるかもしれない：

source: You may also specify the type as the of trait (with returns allowed as a synonym):
ja: あなたは、ofトレイト（同義語としてreturnsを許す）として、型を指定もするかもしれない：

source: Parameter types
ja: パラメーターの型

source: Parameters may be given types, just like any other variable:
ja: パラメータは、型（ちょうど気まぐれな他の人のような）を与えられるかもしれない：

source: Generic types
ja: 汎用的な型

source: Within a declaration, a class variable (either by itself or following an existing type name) declares a new type name and takes its parametric value from the actual type of the parameter it is associated with.
ja: 宣言の範囲内で、クラス変数（それ自体または既存のタイプ名に続くことによって）は新しいタイプ名を宣言して、それが関連するパラメータの実際の型から、そのパラメータの値をとる。

source: It declares the new type name in the same scope as that of the associated declaration.
ja: それは、関連した宣言のそれと同じスコープで、新しいタイプ名を宣言する。

source: The new type name is introduced immediately, so two such types in the same signature must unify compatibly if they have the same name:
ja: 新しいタイプ名はすぐに持ち出されるので、それらには同じ名前があるならば、同じシグネチャのそのような2つの型は両立できるようにひとつにならなければならない：

source: The Cool class (and package)
ja: Coolクラス（そして、パッケージ）

source: The Cool type is derived from Any, and contains all the methods that are &quot;cool&quot; (as in, &quot;I'm cool with an argument of that type.&quot;).
ja: Cool型はAnyに由来して、クールである（中であって、私はその型の引数でクールである。）すべてのメソッドを含む。

source: More specifically, these are the methods that are culturally universal, insofar as the typical user will expect the name of the method to imply conversion to a particular built-in type that understands the method in question.
ja: より詳しくは、典型的ユーザーがメソッドの名前が問題のメソッドを理解する特定の組込み型への転換を意味すると思う限り、これらは文化的に一般的であるメソッドである。

source: For instance, $x.abs implies conversion to an appropriate numeric type if $x is &quot;cool&quot; but doesn't already support a method of that name.
ja: たとえば、$xが涼しいが、その名前のメソッドをすでにサポートしないならば、$x.absは適正数値型への転換を意味する。

source: Conversely, $x.substr implies conversion to a string or buffer type.
ja: 反対に、$x.substrは文字列またはバッファタイプへの転換を意味する。

source: The Cool module also contains all multisubs of last resort;
ja: Coolモジュールも、最後の手段のすべてのmultisubsを含む;

source: these are automatically searched if normal multiple dispatch does not find a viable candidate.
ja: 通常の複数のディスパッチが生存可能な候補を見つけないならば、これらは自動的に捜される。

source: Note that the Cool package is mutable, and both single and multiple dispatch must take into account changes there for the purposes of run-time monkey patching.
ja: Coolパッケージが変わりやすいことに注意すべきである、そして、一つで複数のディスパッチは実行時モンキーパッチングのために変化をそこで考慮しなければならない。

source: However, since the multiple dispatcher uses the Cool package only as a failover, compile-time analysis of such dispatches is largely unaffected for any arguments with an exact or close match.
ja: しかし、複数のディスパッチャがフェールオーバだけとしてCoolパッケージを使用する時から、そのようなディスパッチのコンパイル時分析は主に正確であるか近いマッチで何か引数のために影響を受けない。

source: Likewise any single dispatch a method that is more specific than the Cool class is not affected by the mutability of Cool.
ja: 同様に、一つの何でも、CoolクラスがCoolの移り気に影響を受けないより、はっきりしているメソッドを送る。

source: User-defined classes don't derive from Cool by default, so such classes are also unaffected by changes to Cool.
ja: ユーザー定義のクラスはデフォルトでCoolに由来しないので、そのようなクラスはCoolに変化にも影響を受けない。

source: Names and Variables
ja: 名前と変数

source: Apostrophe separator
ja: アポストロフィセパレーター

source: The $Package'var syntax is gone.
ja: $Package'var構文はなくなる。

source: Use $Package::var instead.
ja: その代わりに$Package::varを使いなさい。

source: (Note, however, that identifiers may now contain an apostrophe or hyphen if followed by a character matching &lt;.alpha&gt;)
ja: （しかし、&lt;.alpha&gt;にマッチしている文字が続くならば、識別子が現在アポストロフィまたはハイフンを含むかもしれない点に注意しなさい）

source: Sigils
ja: シギル

source: Perl 6 includes a system of sigils to mark the fundamental structural type of a variable:
ja: Perl 6は、基本的な構造様式変数の世代に跡を残すために、シギルのシステムを含む：

source: Within a declaration, the &amp; sigil also declares the visibility of the subroutine name without the sigil within the scope of the declaration:
ja: 宣言の範囲内で、&amp;シギルも、シギルなしでサブルーチン名の可視性を宣言の範囲内であると宣言する：

source: Within a signature or other declaration, the :: pseudo-sigil followed by an identifier marks a type variable that also declares the visibility of a package/type name without the sigil within the scope of the declaration.
ja: シグネチャまたは他の宣言の範囲内で、識別子が続く::疑似シギルは、また、シギルなしでパッケージ/型名の可視性を宣言の範囲内であると宣言する型変数に跡を残す。

source: The first such declaration within a scope is assumed to be an unbound type, and takes the actual type of its associated argument.
ja: スコープの中の第1のそのような宣言は、束縛を解かれた型であるとされて、その関連した引数の実際の型をする。

source: With subsequent declarations in the same scope the use of the pseudo-sigil is optional, since the bare type name is also declared.
ja: 裸のタイプ名も宣言される時から、同じスコープの以降の宣言で、疑似シギルの使用はオプションである。

source: A declaration nested within must not use the sigil if it wishes to refer to the same type, since the inner declaration would rebind the type.
ja: 内部の宣言が型を再結合する時から、それが同一性に言及することを望むならば、入れ子にされる宣言はシギルを使ってはならない。

source: (Note that the signature of a pointy block counts as part of the inner block, not the outer block.)
ja: （とがったブロックのシグネチャが内側ブロック（外側ブロックでない）の一部と見なされることに注意すべきである。）

source: Sigils indicate interface
ja: シギルは、インターフェースを示す

source: Sigils indicate overall interface, not the exact type of the bound object.
ja: シギルは、全体的なインターフェース（縛られたオブジェクトの正確な型でない）を示す。

source: Different sigils imply different minimal abilities.
ja: 異なるシギルは、異なる最小の能力を意味する。

source: $x may be bound to any object, including any object that can be bound to any other sigil.
ja: $xは、何かオブジェクト（他のどのシギルの束縛を受けることもありえる何かオブジェクトを含む）の束縛を受ける場合がある。

source: Such a scalar variable is always treated as a singular item in any kind of list context, regardless of whether the object is essentially composite or unitary.
ja: オブジェクトが基本的に合成であるか単位を構成するか否かを問わず、そのようなスカラー変数は常にどんなリストコンテキストの他に類のないアイテムとでもみなされる。

source: It will not automatically dereference to its contents unless placed explicitly in some kind of dereferencing context.
ja: はっきりと何らかの間接参照前後関係に置かれない限り、それは自動的に内容に間接参照を遺贈しない。

source: In particular, when interpolating into list context, $x never expands its object to anything other than the object itself as a single item, even if the object is a container object containing multiple items.
ja: 特に、リストコンテキストに改竄するとき、たとえオブジェクトが複数のアイテムを含んでいるコンテナオブジェクトであるとしても、$xは一つのアイテムとしてもそのオブジェクトをオブジェクトそのもの以外の何にも決して拡大しない。

source: @x may be bound to an object of the Array class, but it may also be bound to any object that does the Positional role, such as a Range, Buf, Parcel, or Capture.
ja: @xはArrayクラスのオブジェクトの束縛を受ける場合がある、しかし、それはPositionalロール（例えばRange、Buf、ParcelまたはCapture）をする何かオブジェクトの束縛を受ける場合もある。

source: The Positional role implies the ability to support postcircumfix:&lt;[ ]&gt;.
ja: Positionalロールは、postcircumfix:&lt;[ ]&gt;をサポートする能力を意味する。

source: Likewise, %x may be bound to any object that does the Associative role, such as Pair, PairSet, Set, Bag, Mix, or Capture.
ja: 同様に、%xは、Associativeロール（例えばPair、PairSet、Set、Bag、MixまたはCapture）をする何かオブジェクトの束縛を受ける場合がある。

source: The Associative role implies the ability to support postcircumfix:&lt; &gt;.
ja: Associativeロールは、postcircumfix:&lt; &gt;をサポートする能力を意味する。

source: &amp;x may be bound to any object that does the Callable role, such as any Block or Routine.
ja: &amp;xは、Callableロール（例えば何かBlockまたはRoutine）をする何かオブジェクトの束縛を受ける場合がある。

source: The Callable role implies the ability to support postcircumfix:&lt;( )&gt;.
ja: Callableロールは、postcircumfix:&lt;( )&gt;をサポートする能力を意味する。

source: In any case, the minimal container role implied by the sigil is checked at binding time at the latest, and may fail earlier (such as at compile time) if a semantic error can be detected sooner.
ja: いずれにせよ、シギルによってほのめかされる最小のコンテナロールは、遅くともバインディング時でチェックされて、意味上の誤りがよりすぐに見つけられることができるならば以前に失敗する場合がある（例えばコンパイル時で）。

source: If you wish to bind an object that doesn't yet do the appropriate role, you must either stick with the generic $ sigil, or mix in the appropriate role before binding to a more specific sigil.
ja: 適正ロールをまだしないオブジェクトを結びつけたいならば、あなたは一般的な$シギルに固執しなければならないか、より特定のシギルにバインディングの前に適正ロールを混ぜなければならない。

source: An object is allowed to support both Positional and Associative.
ja: オブジェクトは、PositionalとAssociativeをサポートするのを許可される。

source: An object that does not support Positional may not be bound directly to @x.
ja: Positionalをサポートしないオブジェクトは、直接@xの束縛を受けない場合がある。

source: However, any construct such as %x that can interpolate the contents of such an object into list context can automatically construct a list value that may then be bound to an array variable.
ja: しかし、リストコンテキストにそのようなオブジェクトの内容を差し込むことができる%xのような何か構成概念は、それから配列変数の束縛を受ける場合があるリスト値を自動的に造ることができる。

source: Subscripting such a list does not imply subscripting back into the original object.
ja: リストのような添え字付けは、最初のオブジェクトへと添え字付けを意味しない。

source: No intervening whitespace
ja: 中の空白文字でない

source: Unlike in Perl 5, you may no longer put whitespace between a sigil and its following name or construct.
ja: Perl 5のとは異なり、シギルとその以下の名前または構成概念の間に空白文字をもはや置かなくてもよい。

source: Ordinary sigils indicate normally scoped variables, either lexical or package scoped.
ja: 普通のシギルは通常捜し出された変数を示す。そして、語彙的であるか、捜し出されて一括である。

source: Oddly scoped variables include a secondary sigil (a twigil) that indicates what kind of strange scoping the variable is subject to:
ja: 妙に捜し出された変数は、変数がどんな変なスコーピングを受けるかについて示す第二のシギル（twigil）を含む：

source: Most variables with twigils are implicitly declared or assumed to be declared in some other scope, and don't need a &quot;my&quot; or &quot;our&quot;.
ja: twigilsによる大部分の変数が、暗黙のうちに宣言されるか、若干の他のスコープで宣言されるとされて、&quot;my&quot;または&quot;our&quot;を必要でない。

source: Attribute variables are declared with has, though.
ja: しかし、属性変数は、hasで宣言される。

source: Scope declarators
ja: スコープ宣言

source: Normal names and variables are declared using a scope declarator:
ja: 通常の名前と変数は、スコープ宣言を使って宣言される：

source: Names may also be declared in the signature of a function.
ja: 名前は、関数のシグネチャで宣言されもするかもしれない。

source: These are equivalent to a my declaration inside the block of the function, except that such parameters default to readonly.
ja: これらは関数のブロック内でmy宣言に等しいが、そのようなパラメータはreadonlyなものにデフォルトでなる。

source: The anon declarator allows a declaration to provide a name that can be used in error messages, but that isn't put into any external symbol table:
ja: anon宣言は、宣言をエラーメッセージで使われることができる、しかし、少しも外部シンボルテーブルに入れられない名前を提供させる：

source: However, the name is introduced into the scope of the declaration itself, so it may be used to call itself recursively:
ja: しかし、名前は宣言そのもののスコープにもたらされるので、それは再帰的に以下を名乗るのに用いられるかもしれない：

source: Invariant sigils
ja: 不変のシギル

source: Sigils are now invariant.
ja: シギルは、現在不変である。

source: $ always means a scalar variable, @ an array variable, and % a hash variable, even when subscripting.
ja: $は常にスカラー変数を意味する。そして、@が配列変数である、そして、添え字付けときでも、%がハッシュ変数である。

source: In item context, variables such as @array and %hash simply return themselves as Array and Hash objects.
ja: アイテム前後関係では、@arrayと%hashのような変数は、単にArrayとHashオブジェクトとして自分自身を返る。

source: (Item context was formerly known as scalar context, but we now reserve the &quot;scalar&quot; notion for talking about variables rather than contexts, much as arrays are disassociated from list context.)
ja: （アイテム前後関係は以前スカラーコンテキストとして知られていた、しかし、非常に配列がリストコンテキストから分離されて、我々は現在「スカラー」概念を前後関係よりもむしろ変数について話すことに確保する。）

source: List stringification
ja: リストstringification

source: In string contexts, lists and list-like objects automatically stringify to appropriate (white-space separated) string values.
ja: ストリングコンテキストでは、リストとリストのようなオブジェクトは、適正（空白文字は分かれた）に、文字列値を自動的にstringifyする。

source: In numeric contexts, the number of elements in the container is returned.
ja: 数値コンテキストでは、コンテナの要素数は、返納印である。

source: In boolean contexts, a true value is returned if and only if there are any elements in the container.
ja: ブール値コンテキストでは、何か要素がコンテナの中にある場合に限り、真値は返納印である。

source: The .perl method
ja: .perlメソッド

source: To get a Perlish representation of any object, use the .perl method.
ja: 何かオブジェクトのPerlish表現を得るために、.perlメソッドを使用しなさい。

source: Like the Data::Dumper module in Perl 5, the .perl method will put quotes around strings, square brackets around list values, curlies around hash values, constructors around objects, etc., so that Perl can evaluate the result back to the same object.
ja: Perl 5でData::Dumperモジュールのようで、.perlメソッドは文字列のあたりの引用、リスト値のあたりの角括弧、ハッシュ値のあたりのcurlies、オブジェクトなどのあたりのコンストラクタを置く、そのため、Perlは同じオブジェクトへ結果を評価することができる。

source: The .perl method will return a representation of the object on the assumption that, if the code is reparsed at some point, it will be used to regenerate the object as a scalar in item context.
ja: .perlメソッドは、コードが数ポイントで再解析されるならば、それがアイテム前後関係のスカラーとしてオブジェクトを再生させるのに用いられるという仮定に関して、オブジェクトの表現を返る。

source: If you wish to interpolate the regenerated object in a list context, it may be necessary to use prefix:&lt;|&gt; to force interpolation.
ja: あなたが再生するオブジェクトをリストコンテキストに勝手に入れたいならば、改竄者を押しつけるためにprefix:&lt;|&gt;を使うことが必要である場合がある。

source: Note that .perl has a very specific definition, and it is expected that some modules will rely on the ability to roundtrip values with EVAL.
ja: .perlが非常に特定の定義を持つことに注意すべきである、そして、若干のモジュールがEVALでroundtrip値に能力に頼ると予想される。

source: As such, overriding .perl with a different format (globally using MONKEY_TYPING, or for specific classes unless special care is taken to maintain parsability) is unwise.
ja: それ自体、異なるフォーマットによる.perlをオーバーライドする（グローバルに使う｛MONKEY_TYPING｝こと、または、特別な世話が好きになられない限り、特定クラスについては、parsabilityを維持しなさい）賢明でない。
